[
    {
        "id": 1,
        "name": "Doa Setelah Shalat Sunnah Tahajud",
        "arabic":"اَللهُمَّ لَكَ الْحَمْدُ اَنْتَ قَيِّمُ السَّمَوَاتِ وَاْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ مَالِكُ السَّمَوَاتِ واْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ نُوْرُ السَّمَوَاتِ وَاْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاءُكَ حَقٌّ وَقَوْلُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالنَّبِيُّوْنَ حَقٌّ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَقٌّ وَالسَّاعَةُ حَقٌّ. اَللهُمَّ لَكَ اَسْلَمْتُ وَبِكَ اَمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَاِلَيْكَ اَنَبْتُ وَبِكَ خَاصَمْتُ وَاِلَيْكَ حَاكَمْتُ فَاغْفِرْلِيْ مَاقَدَّمْتُ وَمَا اَخَّرْتُ وَمَا اَسْرَرْتُ وَمَا اَعْلَنْتُ وَمَا اَنْتَ اَعْلَمُ بِهِ مِنِّيْ. اَنْتَ الْمُقَدِّمُ وَاَنْتَ الْمُؤَخِّرُ لاَاِلَهَ اِلاَّ اَنْتَ. وَلاَ حَوْلَ وَلاَ قُوَّةَ اِلاَّ بِاللهِ",
        "latin": "Allaahumma lakal hamdu anta qayyimus samaa waati wal ardhi wa man fiihinna. Wa lakal hamdu anta malikus samaa waati wal ardhi wa man fiihinna. Wa lakal hamdu anta nuurus samaawaati wal ardhi wa man fiihinna. Wa lakal hamdu antal haqqu, wa wa’dukal haqqu, wa liqaa’uka haqqun, wa qauluka haqqun, wal jannatu haqqun, wannaaru haqqun, wannabiyyuuna haqqun, wa muhammadun shallallaahu ‘alaihi wasallama haqqun wassaa’atu haqqun. Allaahumma laka aslamtu, wa bika aamantu, wa ‘alaika tawakkaltu, wa ilaika anabtu, wa bika khaashamtu, wa ilaika haakamtu, faghfirlii maa qaddamtu, wa maa akh-khartu, wa maa asrartu, wa maa a’lantu, wa maa anta a’lamu bihiminnii. Antal muqaddimu, wa antal mu’akhkhiru, laa ilaaha illaa anta, wa laa haula wa laa quwwata illaa billaah",
        "terjemahan": "Wahai Allah! Milik-Mu lah segala puji. Engkaulah penegak dan pengurus langit dan bumi serta makhluk yang ada di dalamnya. Milik-Mu lah segala puji. Engkaulah penguasa (raja) langit dan bumi serta makhluk yang ada di dalamnya. Milik-Mu lah segala puji. Engkaulah cahaya langit dan bumi serta makhluk yang ada di dalamnya. Milik-Mu lah segala puji. Engkaulah Yang Hak (benar),janji-Mu lah yang benar, pertemuan dengan-Mu adalah benar, perkataan-Mu benar, surga itu benar (ada), neraka itu benar (ada), para nabi itu benar, Nabi Muhammad saw itu benar, dan hari kiamat itu benar(ada). Wahai Allah! Hanya kepada-Mu lah aku berserah diri, hanya kepada-Mu lah aku beriman, hanya kepada-Mu lah aku bertawakkal hanya kepada-Mu lah aku kembali, hanya dehgan-Mu lah kuhadapi musuhku, dan hanya kepada-Mu lah aku berhukum. Oleh karena itu ampunilah segala dosaku, yang telah kulakukan dan yang (mungkin) akan kulakukan, yang kurahasiakan dan yang kulakukan secara terang-terangan, dan dosa-dosa lainnya yang Engkau lebih mengetahuinya daripada aku. Engkaulah Yang Maha Terdahulu dan Engkaulah Yang Maha Terakhir. tak ada Tuhan selain Engkau, dan tak ada daya upaya dan kekuatan kecuali dengan pertolongan Allah."
    },
    {
        "id": 2,
        "name": "Doa Setelah Shalat Sunnah Dhuha",
        "arabic": "اَللهُمَّ اِنَّ الضُّحَآءَ ضُحَاءُكَ، وَالْبَهَاءَ بَهَاءُكَ، وَالْجَمَالَ جَمَالُكَ، وَالْقُوَّةَ قُوَّتُكَ، وَالْقُدْرَةَ قُدْرَتُكَ، وَالْعِصْمَةَ عِصْمَتُكَ. اَللهُمَّ اِنْ كَانَ رِزْقِى فِى السَّمَآءِ فَأَنْزِلْهُ وَاِنْ كَانَ فِى اْلاَرْضِ فَأَخْرِجْهُ وَاِنْ كَانَ مُعَسَّرًا فَيَسِّرْهُ وَاِنْ كَانَ حَرَامًا فَطَهِّرْهُ وَاِنْ كَانَ بَعِيْدًا فَقَرِّبْهُ بِحَقِّ ضُحَاءِكَ وَبَهَاءِكَ وَجَمَالِكَ وَقُوَّتِكَ وَقُدْرَتِكَ آتِنِىْ مَآاَتَيْتَ عِبَادَكَ الصَّالِحِيْنَ",
        "latin": "Allahumma innadh dhuha-a dhuha-uka, wal bahaa-a bahaa-uka, wal jamaala jamaaluka, wal quwwata quwwatuka, wal qudrata qudratuka, wal ishmata ishmatuka. Allahuma inkaana rizqi fis samma-i fa anzilhu, wa inkaana fil ardhi fa-akhrijhu, wa inkaana mu’asaran fayassirhu, wainkaana haraaman fathahhirhu, wa inkaana ba’idan fa qaribhu, bihaqqiduhaa-ika wa bahaaika, wa jamaalika wa quwwatika wa qudratika, aatini maa ataita ‘ibadikash shalihin.",
        "terjemahan": "Wahai Tuhanku, sesungguhnya waktu dhuha adalah waktu dhuha-Mu, keagungan adalah keagunan-Mu, keindahan adalah keindahan-Mu, kekuatan adalah kekuatan-Mu, penjagaan adalah penjagaan-Mu, Wahai Tuhanku, apabila rezekiku berada di atas langit maka turunkanlah, apabila berada di dalam bumi maka keluarkanlah, apabila sukar mudahkanlah, apabila haram sucikanlah, apabila jauh dekatkanlah dengan kebenaran dhuha-Mu, kekuasaan-Mu (Wahai Tuhanku), datangkanlah padaku apa yang Engkau datangkan kepada hamba-hambaMu yang soleh."
    },
    {
        "id": 3,
        "name": "Doa Setelah Shalat Sunnah Istikharah",
        "arabic":"اَللهُمَّ اِنِّى اَسْتَخِيْرُكَ بِعِلْمِكَ وَاَسْتَقْدِرُكَ بِقُدْرَتِكَ وَاَسْئَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ. فَاِنَّكَ تَقْدِرُ وَلَآاَقْدِرُ وَلَآاَعْلَمُ وَاَنْتَ عَلاَّمُ الْغُيُوْبِ. اَللهُمَّ اِنْ كُنْتَ تَعْلَمُ اَنَّ هذَااْلاَمْرَخَيْرٌلِّىْ فِىْ دِيْنِىْ وَمَعَاشِىْ فَاقْدُرْهُ لِىْ وَيَسِّرْهُ لِىْ ثُمَّ بَارِكْ لِىْ فِيْهِ وَاِنْ كُنْتَ تَعْلَمُ اَنَّ هذَااْلاَمْرَشَرٌّلِّىْ فِىْ دِيْنِىْ وَمَعَاشِىْ وَعَاقِبَةِ اَمْرِىْ وَعَاجِلِهِ وَآجِلِهِ فَاصْرِفْهُ عَنِّىْ وَاصْرِفْنِيْ عَنْهُ وَاقْدُرْلِى الْخَيْرَحَيْثُ كَانَ ثُمَّ رَضِّنِىْ بِهِ",
        "latin": "Alloohumma inni astakhiiruka bi'ilmika wa astaqdiruka biqudrotika wa as aluka min fadhlikal 'adzhiimi. Fainnaka taqdiru walaa aqdiru walaa a'lamu wa anta 'al-laamulghuyuubi. Alloohumma inkunta ta'lamu anna haadzal amro khoirun lii fii diinii wama'aasyii faqdurhu lii wa yassirhu lii tsumma baariklii fiihi wa inkunta ta'lamu anna haadzal amro syarrun lii fii diinii wa ma'aasyii wa 'aaqibati amrii wa 'aajilihi fashrifhu 'annii washrifnii 'anhu waqdurlil khoiro haitsu kaana tsumma rodh-dhinii bihi.",
        "terjemahan": "Wahai Allah, bahwasanya aku mohon pilihan olehMu dengan ilmu-Mu, dan mohon kepastian-Mu dengan kekuasaan-Mu, serta mohon kepada-Mu dari anugerah-Mu Yang Maha Agung, karena Engkaulah Dzat yang berkuasa, sedang aku tiada kuasa, dan Engkaulah Dzat Yang Maha Mengetahui, sedang aku tiada mengetahui, dan Engkaulah Dzat yang mengetahui yang ghoib. Wahai Allah, jika adanya, Engkau ketahui bahwa urusan ini ........ adalah baik bagiku, untuk duniaku, akhiratku, penghidupanku, dan akibat urusanku untuk masa sekarang maupun besoknya, maka kuasakanlah bagiku dan permudahkanlah untukku, kemudian berkahilah dalam urusan itu bagiku. Namun jikalau adanya, Engkau ketahui bahwa urusan itu ......... menjadi buruk bagiku, untuk duniaku, akhiratku, penghidupanku, dan akibatnya persoalanku pada masa sekarang maupun besoknya, maka hindarkanlah aku dari padanya, lalu tetapkanlah bagiku kepada kebaikan, bagaimanapun adanya kemudian ridhoilah aku dengan kebaikan itu."
    },
    {
        "id": 4,
        "name": "Doa Setelah Shalat Sunnah Witir",
        "arabic": "اَللهُمَّ إِنَّا نَسْـأَلُكَ اِيْمَانًا دَائِمًا، وَنَسْأَلُكَ قَلْبًا خَاشِعًا، وَنَسْأَلُكَ عِلْمًا نَافِعًا، وَنَسْأَلُكَ يَقِيْنًا صَادِقًا، وَنَسْأَلُكَ عَمَلاً صَالِحًا، وَنَسْأَلُكَ دِيْنًاقَيِّمًا، وَنَسْأَلُكَ خَيْرًا كَثِيْرًا، وَنَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ، وَنَسْأَلُكَ تَمَامَ الْعَافِيَةِ، وَنَسْأَلُكَ الشُّكْرَ عَلَى الْعَافِيَةِ، وَنَسْأَلُكَ الْغِنَاءَ عَنِ النَّاسِ، اَللهُمَّ رَبَّنَا تَقَبَّلْ مِنَّا صَلاَتَنَا وَصِيَامَنَا وَقِيَامَنَا وَتَخُشُّعَنَا وَتَضَرُّعَنَا وَتَعَبُّدَنَا وَتَمِّمْ تَقْصِيْرَنَا يَا اَللهُ يَااَللهُ يَااَللهُ يَااَرْحَمَ الرَّحِمِيْنَ. وَصَلَّى اللهُ عَلَى خَيْرِ خَلْقِهِ مُحَمَّدٍ وَعَلَى اَلِهِ وَصَحْبِهِ اَجْمَعِيْنَ، وَالْحَمْدُ ِللهِ رَبِّ الْعَالَمِيْنَ",
        "latin": "Allahumma innaa nas'aluka iimaanan daa'iman, wanas'aluka qalban khaasyi'an, wanas'aluka 'ilman naafi'an, wanas'aluka yaqiinan shaadiqon, wanas'aluka 'amalan shaalihan, wanas'aluka diinan qayyiman, wanas'aluka khairan katsiiran, wanas'alukal 'afwa wal'aafiyata, wanas'aluka tamaamal 'aafiyati, wanas'alukasy syukra 'alal 'aafiyati, wanas'alukal ghinaa'a 'aninnaasi. Allaahumma rabbanaa taqabbal minnaa shalaatanaa washiyaamanaa waqiyaamanaa watakhusy-syu'anaa watadhorru'anaa wata'abbudanaa watammim taqshiiranaa yaa allaahu yaa allaahu yaa allaahu yaa arhamar raahimiina. Washallallaahu 'alaa khairi khalqihi muhammadin wa'alaa aalihi washahbihi ajma'iina, walhamdu lillaahi rabbil 'aalamiina",
        "terjemahan": "Wahai Allah. Sesungguhnya kami memohon kepada-Mu iman yang tetap, kami memohon kepada-Mu hati yang khusyu', kami memohon kepada-Mu ilmu yang bermanfaat, kami memohon kepada-Mu keyakinan yang benar, kami memohon kepada-Mu amal yang shaleh, kami memohon kepada-Mu agama yang lurus, kami memohon kepada-Mu kebaikan yang banyak, kami memohon kepada-Mu ampunan dan afiat, kami memohon kepada-Mu kesehatan yang sempurna, kami memohon kepada-Mu syukur atas kesehatan, dan kami memohon kepada-Mu terkaya dari semua manusia. Ya Allah, Tuhan kami. Terimalah dari kami shalat kami, puasa kami, shalat malam kami, kekhusyu'an kami, kerendahan hati kami, ibadah kami. Sempurnakanlah kelalaian atau kekurangan kami, Wahai Allah Wahai Allah Wahai Allah Wahai Dzat yang Paling Penyayang diantara para penyayang. Semoga rahmat Allah tercurahkan kepada sebaik-baiknya makhluk-Nya, Muhammad, keluarga dan sahabatnya semua, dan segala puji milik Allah, Tuhan semesta alam."
    },
    {
        "id": 5,
        "name": "Doa Setelah Shalat Sunnah Hajat",
        "arabic": "اَ إِلَهَ إِلاَّ اللهُ الْحَلِيْمُ الْكَرِيْمُ سُبْحَانَ اللهِ رَبُّ الْعَرْشِ الْعَظِيْمِ .اَلْحَمْدُ ِللهِ رَبِّ الْعَالَمِيْنَ. اَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالْعِصْمَةَ مِنْ كُلِّ ذَنْبٍ وَّالْغَنِيْمَةَ مِنْ كُلِّ بِرٍّ وَّالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ لَاتَدَعْ لِيْ ذَنْبًا إِلاَّ غَفَرْتَهُ وَلاَ هَمًّا إِلاَّ فَرَّجْتَهُ وَلاَ حَاجَةً هِيَ لَكَ رِضًا إِلاَّ قَضَيْتَهَا يَا أَرْحَمَ الرَّاحِمِيْنَ",
        "latin": "Laa ilaaha illalllahul haliimul karim. Subhaanallahi rabbil arsyil adzim. Alhamdulillahi rabbil alaamin. As luka muujibaati rahmaatika, wa azaa’imi maghfiratika, wal ghaniimati min kulli birr, wassalaamatin min kulli itsm. Laa tadaaa lii dzamban illaa gharaftah, walaa hamman illa farrajtha, walaa hajaatan hiya laka ridhan illa qadhaaitahaa ya arhamar-raahimin.",
        "terjemahan": "Tiada tuhan selain Allah Yang Mahahalim, Yang maha Bijaksana, lagi Maha Mulia. Mahasuci Allah Tuhan Arsy yang Agung. Segala puji bagi Allah Tuhan Semesta alam. Aku memohon kepada-Mu kepastian rahmat-Mu, perolehan dari tiap-tiap kebaikan dan keselamatan dari dosa, jangan Engkau biarkan diriku berdosa melainkan Engkau ampuni, tidak ada kesusahan melainkan ngkau bukakan jalan keluar dan tiada sesuatu yang diridhoi oleh-Mu melainkan Engkau luluskan ya Allah Yang Maharahim dari semua yang Rahim."
    },
    {
        "id": 6,
        "name": "Doa Setelah Shalat Sunnah Taubat",
        "arabic": "اللّهُمَّ أَنْتَ رَبِّي لآاِلهَ اِلَّااَنْتَ خَلَقْتَنِي وَأَناَ عَبْدُكَ وَأَناَ عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوْذُ بِكَ من شَرِّمَاصَنَعْتَ. اَبُوْءُلَكَ بِنِعْمَتِكَ عَلَي وَأَبُوْءُ بِذَنْبِي فَاغْفِرْلِي فَإِنَّهُ لاَيَغْفِرُ الذُّنُوْبَ اِلاَّ اَنْتَ",
        "latin": "Allaahumma anta rabbii laa ilaaha illaa anta khalaqtanii wa ana'abduka wa ana'alaa 'ahdika wa wa'dika mastatha'tu a'uudzubika min syarri maa shana'tu. abuu ulaka bini'matika 'alayya wa abuu u bidzanbi fahghfirlii fa innahu laa yaghfirudz dzunuuba illaa anta.",
        "terjemahan": "Wahai Tuhan, Engkau adalah Tuhanku, tiada yang patut disembah melainkan hanya Engkau, Engkaulah yang menjadikan aku dan aku adalah hamba-Mu, dan aku dalam ketentuan dan janji-Mu yang Engkau limpahkan kepadaku dan aku mengakui dosaku, karena itulah ampunilah aku, sebab tidak ada yang dapat memberi ampunan melainkan Engkau wahai Tuhanku, sesungguhnya aku berlindung kepada-Mu dari kejahatan apa yang telah aku perbuat"
    }
]